# CurrentUser Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CentralModelContentionException..::..CurrentUser Property
CentralModelContentionException Class See Also
---
Retrieves current user name.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string CurrentUser { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurrentUser As String
	Get
```

Visual C++
---
```text
public:
property String^ CurrentUser {
	String^ get ();
}
```

# See Also
CentralModelContentionException Class
Autodesk.Revit.Exceptions Namespace